# ProjectBrowserOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ProjectBrowserOptions Properties
ProjectBrowserOptions Class See Also
---
The ProjectBrowserOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ShowViewPlacementOnSheetStatusIcons | Show the icons indicating view placement on sheet status. |

# See Also
ProjectBrowserOptions Class
Autodesk.Revit.UI Namespace